In [1]:
import sqlite3
import pandas as pd

In [2]:
pd.options.display.max_columns = None
#pd.options.display.max_rows = None

In [3]:
conn = sqlite3.connect('parch-and-posey.db')

In [4]:
cursor = conn.cursor()
cursor.execute('''
select * from sqlite_master where type = "table";
''')
columns = [col[0] for col in cursor.description]
data = cursor.fetchall()
cursor.close()

In [5]:
pd.DataFrame(data, columns=columns)

,type,name,tbl_name,rootpage,sql
0,table,web_events,web_events,2,"CREATE TABLE web_events (\tid integer,\taccoun..."
1,table,sales_reps,sales_reps,7,"CREATE TABLE sales_reps (\tid integer,\tname b..."
2,table,region,region,222,"CREATE TABLE region (\tid integer,\tname bpchar)"
3,table,orders,orders,223,"CREATE TABLE orders (\tid integer,\taccount_id..."
4,table,accounts,accounts,583,"CREATE TABLE accounts (\tid integer,\tname bpc..."

# WIKI

https://en.wikipedia.org/wiki/Date_format_by_country

# DATE_TRUNC

The first function you are introduced to in working with dates is DATE_TRUNC.

DATE_TRUNC allows you to truncate your date to a particular part of your date-time column. Common trunctions are day, month, and year. Here is a great blog post by Mode Analytics on the power of this function.

https://mode.com/blog/date-trunc-sql-timestamp-function-count-on/

# DATE_PART

DATE_PART can be useful for pulling a specific portion of a date, but notice pulling month or day of the week (dow) means that you are no longer keeping the years in order. Rather you are grouping for certain components regardless of which year they belonged in.

# MORE

For additional functions you can use with dates, check out the documentation here https://www.postgresql.org/docs/9.1/functions-datetime.html, but the DATE_TRUNC and DATE_PART functions definitely give you a great start!

You can reference the columns in your select statement in GROUP BY and ORDER BY clauses with numbers that follow the order they appear in the select statement. For example

SELECT standard_qty, COUNT(*)

FROM orders

GROUP BY 1 (this 1 refers to standard_qty since it is the first of the columns included in the select statement)

ORDER BY 1 (this 1 refers to standard_qty since it is the first of the columns included in the select statement)

In [6]:
# DATE_TRUNC ("day", occurred_at) AS day

pd.read_sql_query(sql='''
SELECT occurred_at, SUM(standard_qty)
FROM orders
GROUP BY 1
ORDER BY 1;
''', con=conn)

              occurred_at  SUM(standard_qty)
0     2013-12-04 04:22:44                  0
1     2013-12-04 04:45:54                490
2     2013-12-04 04:53:25                528
3     2013-12-05 20:29:16                  0
4     2013-12-05 20:33:56                492
...                   ...                ...
6903  2017-01-01 21:04:25                  0
6904  2017-01-01 22:17:26                497
6905  2017-01-01 22:29:50                 38
6906  2017-01-01 23:50:16                291
6907  2017-01-02 00:02:40                 42

[6908 rows x 2 columns]

In [7]:
# DATE_TRUNC ("day", occurred_at) AS day
# strftime('%M-%D-%Y', mydate)
# strftime('%Y-%w', mydate)

pd.read_sql_query(sql='''
SELECT strftime('%Y-%m-%d', occurred_at) AS day, SUM(standard_qty)
FROM orders
GROUP BY 1
ORDER BY 1;
''', con=conn)

             day  SUM(standard_qty)
0     2013-12-04               1018
1     2013-12-05                492
2     2013-12-06               1692
3     2013-12-08               3877
4     2013-12-09                972
...          ...                ...
1055  2016-12-29               2745
1056  2016-12-30               3417
1057  2016-12-31               6449
1058  2017-01-01               5243
1059  2017-01-02                 42

[1060 rows x 2 columns]

In [8]:
pd.read_sql_query(sql='''
SELECT strftime('%Y-%m', occurred_at) AS year_month, SUM(standard_qty)
FROM orders
GROUP BY 1
ORDER BY 1;
''', con=conn)

   year_month  SUM(standard_qty)
0     2013-12              26554
1     2014-01              26744
2     2014-02              28459
3     2014-03              27165
4     2014-04              26390
5     2014-05              28772
6     2014-06              28240
7     2014-07              29875
8     2014-08              30142
9     2014-09              28562
10    2014-10              37433
11    2014-11              29795
12    2014-12              32390
13    2015-01              33995
14    2015-02              31285
15    2015-03              32398
16    2015-04              33430
17    2015-05              36154
18    2015-06              35909
19    2015-07              40698
20    2015-08              37446
21    2015-09              42713
22    2015-10              49149
23    2015-11              51165
24    2015-12              53447
25    2016-01              56022
26    2016-02              56758
27    2016-03              68378
28    2016-04              71762
29    2016-05              70841
30    2016-06             102390
31    2016-07              87616
32    2016-08              97114
33    2016-09             103977
34    2016-10             121065
35    2016-11             114831
36    2016-12             123997
37    2017-01               5285

In [9]:
pd.read_sql_query(sql='''
SELECT strftime('%Y', occurred_at) AS year, SUM(standard_qty)
FROM orders
GROUP BY 1
ORDER BY 1;
''', con=conn)

   year  SUM(standard_qty)
0  2013              26554
1  2014             353967
2  2015             477789
3  2016            1074751
4  2017               5285

In [10]:
pd.read_sql_query(sql='''
SELECT strftime('%Y', occurred_at) AS year, SUM(standard_qty)
FROM orders
GROUP BY year
ORDER BY year;
''', con=conn)

   year  SUM(standard_qty)
0  2013              26554
1  2014             353967
2  2015             477789
3  2016            1074751
4  2017               5285

In [11]:
# DATE_PART ("month", occurred_at)

pd.read_sql_query(sql='''
SELECT strftime('%m', occurred_at) AS month, SUM(standard_qty)
FROM orders
GROUP BY 1
ORDER BY 1;
''', con=conn)

   month  SUM(standard_qty)
0     01             122046
1     02             116502
2     03             127941
3     04             131582
4     05             135767
5     06             166539
6     07             158189
7     08             164702
8     09             175252
9     10             207647
10    11             195791
11    12             236388

In [12]:
# DATE_PART ("month", occurred_at)

pd.read_sql_query(sql='''
SELECT strftime('%H', occurred_at) AS hour, SUM(standard_qty)
FROM orders
GROUP BY 1
ORDER BY 1;
''', con=conn)

   hour  SUM(standard_qty)
0    00              88332
1    01              52294
2    02              81341
3    03              80611
4    04              94644
5    05              76098
6    06              77563
7    07              77959
8    08              81711
9    09              95524
10   10              73752
11   11              83766
12   12              80900
13   13             105966
14   14              61165
15   15              82967
16   16              76300
17   17              78393
18   18              75969
19   19              81818
20   20              74930
21   21              96186
22   22              79488
23   23              80669

In [13]:
# DATE_PART ("month", occurred_at)

pd.read_sql_query(sql='''
SELECT strftime('%M', occurred_at) AS minute, SUM(standard_qty)
FROM orders
GROUP BY 1
ORDER BY 1;
''', con=conn)

   minute  SUM(standard_qty)
0      00              32220
1      01              30993
2      02              31963
3      03              23135
4      04              40659
5      05              22719
6      06              27657
7      07              29768
8      08              36085
9      09              32139
10     10              32588
11     11              33010
12     12              30957
13     13              36095
14     14              26897
15     15              30903
16     16              35217
17     17              30809
18     18              30735
19     19              49252
20     20              25988
21     21              36607
22     22              29685
23     23              36995
24     24              27732
25     25              32180
26     26              29386
27     27              27915
28     28              32985
29     29              30886
30     30              33391
31     31              29537
32     32              59024
33     33              36441
34     34              33698
35     35              27647
36     36              31970
37     37              34352
38     38              29138
39     39              31032
40     40              29059
41     41              33272
42     42              30660
43     43              31155
44     44              36652
45     45              29502
46     46              30756
47     47              32113
48     48              36525
49     49              27009
50     50              33445
51     51              28822
52     52              23724
53     53              35908
54     54              30294
55     55              31761
56     56              30852
57     57              32909
58     58              40452
59     59              33086

In [14]:
pd.read_sql_query(sql='''
SELECT strftime('%S', occurred_at) AS second, SUM(standard_qty)
FROM orders
GROUP BY 1
ORDER BY 1;
''', con=conn)

   second  SUM(standard_qty)
0      00              38816
1      01              35181
2      02              20738
3      03              30064
4      04              35700
5      05              30848
6      06              27379
7      07              29017
8      08              23764
9      09              31216
10     10              32917
11     11              29746
12     12              34829
13     13              21670
14     14              32235
15     15              28984
16     16              32219
17     17              33284
18     18              28560
19     19              35194
20     20              25784
21     21              33001
22     22              36836
23     23              27809
24     24              29628
25     25              31863
26     26              29376
27     27              30591
28     28              33422
29     29              30394
30     30              26187
31     31              48212
32     32              35565
33     33              37301
34     34              28926
35     35              37704
36     36              39883
37     37              33893
38     38              29928
39     39              27472
40     40              27662
41     41              28591
42     42              31056
43     43              29247
44     44              28041
45     45              34557
46     46              36592
47     47              32485
48     48              28658
49     49              30895
50     50              39648
51     51              37184
52     52              34346
53     53              40705
54     54              29376
55     55              49926
56     56              31407
57     57              28411
58     58              34551
59     59              38872

In [18]:
# DATE_PART('dow', occurred_at)

pd.read_sql_query(sql='''
SELECT strftime('%w', occurred_at) AS day_of_week, SUM(standard_qty)
FROM orders
GROUP BY 1
ORDER BY 2 DESC;
''', con=conn)

  day_of_week  SUM(standard_qty)
0           5             299578
1           3             286285
2           0             279629
3           6             276572
4           2             271922
5           4             267389
6           1             256971